[
    {
        "title": "How Budget 2025 could shape the future of Indian farmers",
        "excerpt": "Agriculture sector contributes over 15% to India's GDP and employs 45% of the population. Farmers face distress and seek measures like lower loan interest rates, increased PM-KISAN support, and GST exemptions. The upcoming Union...",
        "date": "06 Jan, 2025, 10:08 PM IST",
        "link": "https://economictimes.indiatimes.com/news/economy/policy/how-budget-2025-could-shape-the-future-of-indian-farmers/articleshow/116985978.cms"
    },
    {
        "title": "IIT Madras collaborates with Agriculture Ministry on Project VISTAAR",
        "excerpt": "Madhya Pradesh Chief Minister Mohan Yadav emphasized the potential of drone technology, highlighting its current use in agriculture and future applications in various sectors, including crowd and traffic management. At the inauguration...",
        "date": "05 Jan, 2025, 10:12 PM IST",
        "link": "https://economictimes.indiatimes.com/topic/agriculture-technology"
    },
    {
        "title": "Govt extends 2 crop insurance schemes till 2025-26; creates Rs 824.77 cr fund for tech infusion",
        "excerpt": "The Indian government has extended crop insurance schemes PMFBY and RWBCIS till 2025-26. They also allocated Rs 824.77 crore for technology infusion. This will enhance crop damage assessment and claim settlement. The extensio...",
        "date": "01 Jan, 2025, 05:39 PM IST",
        "link": "https://economictimes.indiatimes.com/news/economy/agriculture/govt-extends-2-crop-insurance-schemes-till-2025-26-creates-rs-824-77-cr-fund-for-tech-infusion/articleshow/116857066.cms"
    },
    {
        "title": "Agritech sector to create 60-80K new job opportunities in next 5 years",
        "excerpt": "The agritech sector in India is projected to generate 60,000 to 80,000 jobs in the next five years in roles like AI development, technology, and supply chain management. With 450 startups and a $24 billion market, it focuses on technological innovations that enhance farming and empower farmers...",
        "date": "01 Jan, 2025, 04:18 PM IST",
        "link": "https://economictimes.indiatimes.com/jobs/mid-career/agritech-sector-to-create-60-80k-new-job-opportunities-in-next-5-years/articleshow/116854561.cms"
    }
]
